RIET/src/Documents/Поставка/Поставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поставка</name>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <attributes>
    <name>ИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Shipper</name>
    <type>
      <types>CatalogRef.Shippers</types>
    </type>
  </attributes>
  <attributes>
    <name>FreightForwarder</name>
    <type>
      <types>CatalogRef.FreightForwarders</types>
    </type>
  </attributes>
  <attributes>
    <name>HouseWB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WB2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WB3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WB4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WBList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PiecesQty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalWBWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Freight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>ActualPOA</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВажности</name>
    <type>
      <types>EnumRef.СтатусыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>OOC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreAlertETA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ETA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ATA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CollectedFromPort</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentCargoStage</name>
    <type>
      <types>EnumRef.ShipmentCargoStages</types>
    </type>
  </attributes>
  <attributes>
    <name>PreAlert</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DoxForCCA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DoxRcvd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PermitsObtained</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InCustoms</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Cleared</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentDocumentStage</name>
    <type>
      <types>EnumRef.ShipmentDocumentStages</types>
    </type>
  </attributes>
  <attributes>
    <name>WithoutPreAlert</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WithoutGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PendingSLB</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignToList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DOCList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InfoOnHazardClasses</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Inspection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InspectionStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InspectionEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCAJobReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SWIFTRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SWIFTRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SWIFTReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SegmentsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>PSA</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>PSARequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PSAReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Completed</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ConditionalRelease</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCDNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>COOReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreInspection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PreInspectionStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreInspectionEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCACurrentComment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FormalGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMSShipmentID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>TranzitZoneETA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TessNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УпаковочныеЛисты</name>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.КонсолидированныйПакетЗаявокНаПеревозку</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OutOfComplianceReasons</name>
    <attributes>
      <name>OutOfComplianceReason</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLines</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>AcceptedBySLB</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>NotAcceptedBySLB</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ConditionalRelease</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/ЗакрытиеПоставки/ЗакрытиеПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеПоставки</name>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.TemporaryImpExpTransactions</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>Поставка</name>
    <type>
      <types>DocumentRef.TemporaryImpExpTransactions</types>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОбменаРИЕТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сопоставление</name>
    <attributes>
      <name>СтрокаИнвойса</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварСтрокиГТД</name>
      <type>
        <types>CatalogRef.ТоварыСтрокГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/Поставка/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзInvoiceLinesMatching" Тогда
			НастроитьДляВыбораИзInvoiceLinesMatching(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("Отменен", Ложь);
	
	ImportExportСервер.ДобавитьОтборПоProcessLevelПриНеобходимости(Отбор, "ProcessLevel");
		
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзInvoiceLinesMatching(СтруктураНастройки)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("CurrentInvoiceLinesMatching", СтруктураНастройки.CurrentInvoiceLinesMatching);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поставки.Ссылка
		|ИЗ
		|	Документ.Поставка КАК Поставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеПоставки КАК InvoiceLinesMatching
		|		ПО Поставки.Ссылка = InvoiceLinesMatching.Поставка
		|			И ((НЕ InvoiceLinesMatching.ПометкаУдаления))
		|			И ((НЕ InvoiceLinesMatching.Ссылка = &CurrentInvoiceLinesMatching))
		|ГДЕ
		|	(НЕ Поставки.Отменен)
		|	И (НЕ Поставки.Cleared = ДАТАВРЕМЯ(1, 1, 1))
		|	И InvoiceLinesMatching.Ссылка ЕСТЬ NULL ";
	Shipments = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	СтруктураОтбора = Параметры.Отбор;
	СтруктураОтбора.Вставить("Ссылка", Shipments);
	
КонецПроцедуры
